{
    "trophies": [
      {
        "day": 1,
        "title": "Spark Starter",
        "verse": "Zechariah 4:10",
        "text": "Do not despise these small beginnings, for the Lord rejoices to see the work begin.",
        "description": "Your altar is lit. Even the smallest spark shakes the darkness. Keep it burning."
      },
      {
        "day": 3,
        "title": "Kindled Flame",
        "verse": "Leviticus 6:13",
        "text": "The fire must be kept burning on the altar continuously; it must not go out.",
        "description": "You’ve made prayer a rhythm. This flame is alive — don't let it die."
      },
      {
        "day": 6,
        "title": "Burning Ember",
        "verse": "Psalm 141:2",
        "text": "May my prayer be set before you like incense.",
        "description": "Your altar carries fragrance before Heaven. Your consistency is holy."
      },
      {
        "day": 9,
        "title": "Flickering Torch",
        "verse": "Judges 7:20",
        "text": "A sword for the Lord and for Gideon!",
        "description": "Your light confuses the enemy. You're becoming dangerous to darkness."
      },
      {
        "day": 12,
        "title": "Lit Lamp",
        "verse": "Matthew 5:14",
        "text": "You are the light of the world. A city set on a hill cannot be hidden.",
        "description": "You’re shining publicly. Your altar is now a beacon."
      },
      {
        "day": 15,
        "title": "Flame Carrier",
        "verse": "Isaiah 60:1",
        "text": "Arise, shine, for your light has come.",
        "description": "You're carrying fire into dark places. Heaven’s glory rests on you."
      },
      {
        "day": 18,
        "title": "Minister of Fire",
        "verse": "Hebrews 1:7",
        "text": "He makes His ministers flames of fire.",
        "description": "You’re no longer just praying — you’re becoming the prayer."
      },
      {
        "day": 21,
        "title": "Golden Bowl Filler",
        "verse": "Revelation 5:8",
        "text": "Golden bowls full of incense, which are the prayers of God’s people.",
        "description": "Your prayers echo in eternity. The bowls are filling because of your faithfulness."
      },
      {
        "day": 24,
        "title": "Altar Builder",
        "verse": "1 Kings 18:30",
        "text": "Elijah repaired the altar of the Lord.",
        "description": "You are restoring sacred spaces in your life. You're a rebuilder."
      },
      {
        "day": 27,
        "title": "Consuming Fire",
        "verse": "Hebrews 12:29",
        "text": "Our God is a consuming fire.",
        "description": "You’ve become what you behold. Your life is no longer lukewarm."
      },
      {
        "day": 30,
        "title": "Breaker Flame",
        "verse": "Micah 2:13",
        "text": "The One who breaks open will go before them.",
        "description": "Your altar breaks things open. Chains, atmospheres, and hearts — through prayer."
      },
      {
        "day": 33,
        "title": "Watchman on Fire",
        "verse": "Isaiah 62:6",
        "text": "I have posted watchmen on your walls; they will never be silent.",
        "description": "You are Heaven’s eyes on earth. You don't just pray — you guard gates."
      },
      {
        "day": 36,
        "title": "Anointed Flame",
        "verse": "Psalm 92:10",
        "text": "I have been anointed with fresh oil.",
        "description": "You burn with fresh fire. The Spirit has marked your altar."
      },
      {
        "day": 39,
        "title": "Voice of Thunder",
        "verse": "Revelation 14:2",
        "text": "I heard a voice from heaven like the roar of rushing waters and thunder.",
        "description": "Your voice shakes dimensions. Prayer has become power."
      },
      {
        "day": 42,
        "title": "Refiner’s Vessel",
        "verse": "Malachi 3:3",
        "text": "He will sit as a refiner and purifier of silver.",
        "description": "Prayer has purified you. You're carrying the fire of holiness."
      },
      {
        "day": 45,
        "title": "Holy Blaze",
        "verse": "Acts 2:3",
        "text": "They saw what seemed to be tongues of fire that separated and came to rest on each of them.",
        "description": "You’ve become a living Pentecost. Heaven’s flame rests on you."
      },
      {
        "day": 48,
        "title": "Burning Intercessor",
        "verse": "Romans 8:26",
        "text": "The Spirit Himself intercedes for us through wordless groans.",
        "description": "You’re now partnering with the Spirit. You don’t pray alone anymore."
      },
      {
        "day": 51,
        "title": "Temple Flame",
        "verse": "1 Corinthians 3:16",
        "text": "Don’t you know that you yourselves are God’s temple and that God’s Spirit dwells in you?",
        "description": "You are the altar now. Prayer isn’t just what you do — it’s who you are."
      },
      {
        "day": 54,
        "title": "Prophetic Fire",
        "verse": "Jeremiah 20:9",
        "text": "His word is in my heart like a fire, a fire shut up in my bones.",
        "description": "You speak with flame. You pray with fire. Your words are a sword."
      },
      {
        "day": 57,
        "title": "Altar of Nations",
        "verse": "Isaiah 56:7",
        "text": "My house will be called a house of prayer for all nations.",
        "description": "Your altar isn’t small anymore. You’re praying on behalf of nations."
      },
      {
        "day": 60,
        "title": "Living Sacrifice",
        "verse": "Romans 12:1",
        "text": "Offer your bodies as a living sacrifice, holy and pleasing to God.",
        "description": "You’ve become the offering. A living altar. A minister of the eternal flame."
      }
    ]
  }